// task 5
// Создайте переменные a6, a7, a8, a9, a10. Поместите в них результат выражений:
//   5 % 3,
//   3 % 5,
//   5 + '3',
//   '5' - 3,
//   75 + 'кг'
// Вывести все результаты через запятую используя alert или console.log
let a6 = 5 % 3;
let a7 = 3 % 5;
let a8 = 5 + '3';
let a9 = '5' - 3;
let a10 = 15 + 'кг'
console.log(`${a6}, ${a7}, ${a8}, ${a9}, ${a10}`)

//task 6
// Создайте переменные для каждого выражения. 
// При помощи математических операторов найдите значения выражений:
// (5 + 3) * (5 - 3), (10 - 6) * 200, (534 * 132) / 18, 123 * 3 + 10, 12 * 13 * 14;
// Поместив результат каждого выражения в соответствующую переменную.
// Вывести все результаты через запятую используя alert или console.log
let a = (5 + 3) * (5 - 3);
let b = (10 - 6) * 200;
let c = (534 * 132) / 18;
let d = 123 * 3 + 10;
let e = 12 * 13 * 14;
console.log(`${a}, ${b}, ${c}, ${d}, ${e}`)

// task 7
// Определить переменные с понятными именами с 
// помощью которых можно описать машину и ее части. 
// Проиницилизировать данные переменные значениями с типами number и string.
// Вывести информацию:

// "Машина состоит из 1 двигателя, 4 колес, корпуса и органов управления.";
// Используя alert или console.log
let 
// task 8
// Создайте скрипт, который запрашивает ввод двух чисел (используйте prompt) и после показывает их сумму с помощью alert. (есть подводный камень)

// task 9
// С помощью диалогового окна prompt попросите пользователя ввести любое челое число. После чего отобразите alert, говорящий четное или не четное это число.

// task 10
// С помощью диалогового окна prompt попросите пользователя ввести любое не целое число. После чего отобразите alert, возвращающий часть из данного числа.
// Пример:
// ввод 4.2 -> вывод 4
// ввод 5.878 -> вывод 5

// task 11
// Перобразуйте данную строку в строку с нижним регистром(все буквы должны быть строчными): "JAVAScript HAS A dynamic TYPIZATION"

// task 12
// Дана строка "javascript is the most interesting language in the world". Перобразуйте данную строку в строку с верхним регистром(все буквы должны быть заглавными).

// task 13
// Есть строка "JavaScript$123 is 145 not 12 a Java111".
// Необходимо достать из нее все числа, сохранить их в переменные и вывести через запятую с помощью alert или conosle.log.

//  14
// Напишите скрипт при котором появляется окно где юзер вводит строку, 
// после чего возвращается значение true eсли в этой строке есть слово JS и false если нет. 
// Вывести результат с помощью alert или conosle.log. Регистр не имеет значения.

// 15
// Напишите скрипт при котором появляется окно где юзер вводит строку, 
// потом новое окно где юзер вводит число(меньше чем длинна изночальной строки). 
// Необходимо усечь данную страку таким образом, чтобы длинна строки должна быть равна вводимому числу. Результат вывести при помощи alert или console.log.

// Пример:
// строка - "Hello world!"
// число - 7
// результат - "Hello w"